GenevGitHub/simple_peripheral_cc2640r2lp_app-New-Version-/Application/brakeAndThrottle.c
    }
    if (throttleADCAvg > THROTTLE_ADC_THRESHOLD_H)
    {
        throttle_errorStatus = 1;
        // if throttle errorStatus = 1 -> disable throttle input and zero Iq command to Motor Controller Unit
        ledControl_getError(11);
    }
    /*******************************************************************************************************************************
     *      Throttle Signal Calibration
     *      Truncates the average throttle ADC signals to within THROTTLE_ADC_CALIBRATE_L and THROTTLE_ADC_CALIBRATE_H
     *******************************************************************************************************************************/
    if((throttleADCAvg > THROTTLE_ADC_CALIBRATE_H) && (throttleADCAvg <= THROTTLE_ADC_THRESHOLD_H))
    {
        throttleADCAvg = THROTTLE_ADC_CALIBRATE_H;
    }
    if((throttleADCAvg < THROTTLE_ADC_CALIBRATE_L) && (throttleADCAvg >= THROTTLE_ADC_THRESHOLD_L))
    {
        throttleADCAvg = THROTTLE_ADC_CALIBRATE_L;
    }
    /*******************************************************************************************************************************
     *      Error Checking
     *      Check whether brake ADC reading is logical, if illogical, brakeAndThrottle_errorMsg = error (!=0)
     *      These Conditions occur when brake signals/power are not connected, or incorrect supply voltage
     *      Once this condition occurs (brakeAndThrottle_errorMsg != 0), check brake connections, hall sensor fault,
     *      Reset (Power off and power on again) is require to reset brakeAndThrottle_errorMsg.
     *******************************************************************************************************************************/
    if ((brakeADCAvg < BRAKE_ADC_THRESHOLD_L) || (brake_errorLog == 1))
    {
        brake_errorLog = 1;
        if ((brake_errorStatus == 0) && (adc2Result <= THROTTLE_ADC_CALIBRATE_L))       // For safety reason, will change only when throttle value is less than THROTTLE_ADC_CALIBRATE_L
        {
            brakeAndThrottle_errorMsg = BRAKE_ERROR;
            brake_errorStatus = 1;
            speedMode = BRAKE_AND_THROTTLE_SPEED_MODE_AMBLE;
            brakeAndThrottle_toggleSpeedMode();
            ledControl_setSpeedMode(speedMode);
            // if brake errorStatus = 1 -> limited to Amble mode Only
            brake_errorLog = 0;
            /*Send error code to the Motor Controller*/
        }
        ledControl_getError(10);
        /*Send error code to the Motor Controller*/
    }

    if ((brakeADCAvg < BRAKE_ADC_THRESHOLD_L) || (brake_errorLog == 1))
    {
        brake_errorLog = 1;
        if ((brake_errorStatus == 0) && (adc2Result <= THROTTLE_ADC_CALIBRATE_L))       // For safety reason, will change only when throttle value is less than THROTTLE_ADC_CALIBRATE_L
        {
            brakeAndThrottle_errorMsg = BRAKE_ERROR;
            brake_errorStatus = 1;
            speedMode = BRAKE_AND_THROTTLE_SPEED_MODE_AMBLE;
            brakeAndThrottle_toggleSpeedMode();
            ledControl_setSpeedMode(speedMode);
            // if brake errorStatus = 1 -> limited to Amble mode Only
            brake_errorLog = 0;
            /*Send error code to the Motor Controller*/
        }
        ledControl_getError(10);
        /*Send error code to the Motor Controller*/
    }

    /*******************************************************************************************************************************
     *      Brake Signal Calibration
     *      Truncates the average brake ADC signals to within BRAKE_ADC_CALIBRATE_L and BRAKE_ADC_CALIBRATE_H
     *******************************************************************************************************************************/
    if((brakeADCAvg > BRAKE_ADC_CALIBRATE_H) && (brakeADCAvg <= BRAKE_ADC_THRESHOLD_H))
    {
        brakeADCAvg = BRAKE_ADC_CALIBRATE_H;
    }
    if((brakeADCAvg < BRAKE_ADC_CALIBRATE_L) && (brakeADCAvg >= BRAKE_ADC_THRESHOLD_L))
    {
        brakeADCAvg = BRAKE_ADC_CALIBRATE_L;
    }

    /********************************************************************************************************************************
     *  brakePercent is in percentage - has value between 0 - 100 %
     ********************************************************************************************************************************/
    //uint16_t
    brakePercent = (uint16_t) ((brakeADCAvg - BRAKE_ADC_CALIBRATE_L) * 100 / (BRAKE_ADC_CALIBRATE_H - BRAKE_ADC_CALIBRATE_L));

    /********************** Brake Power Off Protect State Machine  *******************************************************************************
     *              if brake is pressed, i.e. brakePercent is greater than a certain value (15%), for safety purposes,
     *              dashboard will instruct motor controller to cut power to motor.
     *              Once power to motor is cut, both the brake & throttle must be released before power delivery can be resumed
    **********************************************************************************************************************************************/
    if (brake_errorStatus == 0)         // under normal condition
    {
        if ((brakeStatus == 1) && (throttlePercent >= throttlePercent0 * THROTTLEPERCENTREDUCTION))
        {                           // condition when rider has not release the throttle
            if ((throttlePercent0 == 0) && (brakePercent <= BRAKEPERCENTTHRESHOLD))                                             // This condition resets brakeStatus to zero
            {
                brakeStatus = 0;
            }
//            else {                                                                                                            // This condition is not necessary
//                brakeStatus = 1;                                                                                              // Since brakeStatus is initially = 1
//            }
        }
        else if ((brakeStatus == 0) && (brakePercent > BRAKEPERCENTTHRESHOLD)) {                                                // condition when brake is not initially pressed and rider pulls on the brake
            brakeStatus = 1;
            throttlePercent0 = throttlePercent;
        }
        else if ((throttlePercent < throttlePercent0 * THROTTLEPERCENTREDUCTION) && (brakePercent <= BRAKEPERCENTTHRESHOLD)) {  // condition when rider releases the throttle && brake is released
            brakeStatus = 0;
        }
    }
    else {                              // when brake error is present
        brakeStatus = 0;
    }

    if (brakeStatus == 1) //Brake Pressed
    {
        STM32MCP_setEscooterControlDebugFrame(STM32MCP_ESCOOTER_BRAKE_PRESS);
        // send instruction to STM32 to activate brake light
        // for regen-brake, send brakePercent to STM32
    }
    else //Brake Released
    {
        //STM32MCP_setEscooterControlDebugFrame(STM32MCP_ESCOOTER_BRAKE_RELEASE);
        // brake light off
        // regen-brake off
    }
    /********************************************************************************************************************************
     *  throttlePercent is in percentage - has value between 0 - 100 %
     ********************************************************************************************************************************/
    //uint16_t
    throttlePercent = (uint16_t) ((throttleADCAvg - THROTTLE_ADC_CALIBRATE_L) * 100 / (THROTTLE_ADC_CALIBRATE_H - THROTTLE_ADC_CALIBRATE_L));

