GenevGitHub/simple_peripheral_cc2640r2lp_app-New-Version-/Application/brakeAndThrottle.c
    // Throttle Error Safety Protocol -> when throttle error detected, IQValue is set to zero
    if (throttle_errorStatus == 0)
    {
        if (brakeStatus == 1)
        {
            IQValue = 0;
        }
        else
        {
            IQValue = BRAKE_AND_THROTTLE_TORQUEIQ_MAX * reductionRatio * throttlePercent / 10000;
        }
    }
    else
    {
        IQValue = 0;
    }

    /********************************************************************************************************************************
     * Send the throttle signal to STM32 Motor Controller
     ********************************************************************************************************************************/
    // in "brakeAndThrottle_CB(allowableSpeed, IQValue, brakeAndThrottle_errorMsg)", brakeAndThrottle_errorMsg is sent to the motor control unit for error handling if necessary.
    brakeAndThrottle_CBs -> brakeAndThrottle_CB(allowableSpeed, IQValue, brakeAndThrottle_errorMsg);
    /********************************************************************************************************************************
     *      The following is a safety critical routine/condition
     *      Firmware only allows speed mode change when throttle is not pressed concurrently/fully released
     *      If speed mode is changed && throttle is not pressed or is released,
     *      firmware will then send instructions to STM32 and assigns speed mode parameters
     ********************************************************************************************************************************/
//    if ((speedModeChgFlag == 1) && (adc2Result <= THROTTLE_ADC_CALIBRATE_L))
//    {
////        motorcontrol_speedModeChgCB(speedModeIQmax, allowableSpeed, rampRate);
//        speedModeChgFlag = 0;
//        speedModeChgCheck++;
//    }

    //Sends brake signal to the controller for tail light toggling
    //Do it as you like !!!

    //Send brake percentage for Regen Brake....
    //Do it as you like

    if (gapRoleChanged == 1)
    {
        motorcontrol_setGatt(DASHBOARD_SERV_UUID, DASHBOARD_SPEED_MODE, DASHBOARD_SPEED_MODE_LEN, (uint8_t *) &speedMode);  //update speed mode on client (App)
        lightControl_gapRoleChg();
        gapRoleChanged = 0;
    }
}

/*********************************************************************
 * @fun    brakeAndThrottle_normalLawControl
 *
 * @brief   Normal Law Algorithm
 *
 * @param   Nil
 *
 * @return  Nil
 *********************************************************************/
static void brakeAndThrottle_normalLawControl()
{
    uint8_t brakeAndThrottleIndex_minus_1;
    uint8_t brakeAndThrottleIndex_minus_2;

    if (brakeAndThrottleIndex == 1)
    {
        brakeAndThrottleIndex_minus_1 = 0;
        brakeAndThrottleIndex_minus_2 = BRAKE_AND_THROTTLE_SAMPLES - 1;
    }
    else if (brakeAndThrottleIndex == 0)
    {
        brakeAndThrottleIndex_minus_1 = BRAKE_AND_THROTTLE_SAMPLES - 1;
        brakeAndThrottleIndex_minus_2 = BRAKE_AND_THROTTLE_SAMPLES - 2;
    }
    else
    {
        brakeAndThrottleIndex_minus_1 = brakeAndThrottleIndex - 1;
        brakeAndThrottleIndex_minus_2 = brakeAndThrottleIndex - 2;
    }

    if (adc2Result >= THROTTLE_ADC_CALIBRATE_L)
    {
        // ******* Get RPM from motor control Unit  ******************
        periodicCommunication_STM32MCP_getRegisterFrame();
        //RPM_array[ brakeAndThrottleIndex_minus_1 ] = (*ptr_brakeAndThrottle_MCUDArray).speed_rpm;
        RPM_array[ brakeAndThrottleIndex_minus_1 ] = 310 * (float)sin(2 * (float) M_PI / 3 * tempTime) + 390;   // dummy data
        tempTime = tempTime + 0.1;      // dummy data

        //int16_t delta_adc = throttleADCValues[ brakeAndThrottleIndex_minus_1 ] - throttleADCValues[ brakeAndThrottleIndex_minus_2 ];
        delta_adc = throttleADCValues[ brakeAndThrottleIndex_minus_1 ] - throttleADCValues[ brakeAndThrottleIndex_minus_2 ];
        //int16_t delta_RPM = RPM_array[ brakeAndThrottleIndex_minus_1 ] - RPM_array[ brakeAndThrottleIndex_minus_2 ];
        delta_RPM = RPM_array[ brakeAndThrottleIndex_minus_1 ] - RPM_array[ brakeAndThrottleIndex_minus_2 ];
        //uint16_t adc_temp = 0;

        if (RPM_array[brakeAndThrottleIndex_minus_1 ] >= allowableSpeed)
        {
            if ((delta_RPM <= 0)|(delta_adc <= 0))
            {
                adc_temp = THROTTLE_ADC_CALIBRATE_L + (uint32_t) ((throttleADCValues[ brakeAndThrottleIndex_minus_1 ] - THROTTLE_ADC_CALIBRATE_L) * allowableSpeed) / RPM_array[ brakeAndThrottleIndex_minus_1 ];
            }
            else
            {
                adc_temp = throttleADCValues[ brakeAndThrottleIndex_minus_1 ] + (uint32_t) (delta_adc * (adc2Result - throttleADCValues[ brakeAndThrottleIndex_minus_1 ])) / delta_RPM;
            }
        }
        else
        {
            float yy = (1 - RPM_array[ brakeAndThrottleIndex_minus_1 ] / allowableSpeed);
            float ff = pow(yy, BRAKE_AND_THROTTLE_QQ);
            adc_temp = throttleADCValues[ brakeAndThrottleIndex_minus_1 ] + (float)(ff * (adc2Result - throttleADCValues[ brakeAndThrottleIndex_minus_1 ]));
        }

        if (adc2Result >= adc_temp)
        {
            adc2Result = adc_temp;
        }
    }
}

/******************************************************
 *
 ******************************************************/
void brakeAndThrottle_gapRoleChg(uint8_t flag)
{
    gapRoleChanged = flag;
}
